## 🚀 Terragrunt Plan - github-repository

#### Project: `github-repository`
#### Environment: `generated-manifests`
#### Branch: `feature/test`
#### Terragrunt Plan: `success`

<details><summary>📋 Show Plan Output</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.github_repository_logs will be created
  + resource "aws_cloudwatch_log_group" "github_repository_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/github-repository/generated-manifests"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Component"   = "github-repository-management"
          + "Environment" = "generated-manifests"
          + "LogGroup"    = "github-repository-generated-manifests"
          + "ManagedBy"   = "terragrunt"
          + "Project"     = "github-repository"
          + "Purpose"     = "github-repository-management"
          + "Repository"  = "monorepo"
          + "Team"        = "panicboat"
        }
      + tags_all          = {
          + "Component"   = "github-repository-management"
          + "Environment" = "generated-manifests"
          + "LogGroup"    = "github-repository-generated-manifests"
          + "ManagedBy"   = "terragrunt"
          + "Project"     = "github-repository"
          + "Purpose"     = "github-repository-management"
          + "Repository"  = "monorepo"
          + "Team"        = "panicboat"
        }
    }

  # github_branch_protection.develop[0] will be created
  + resource "github_branch_protection" "develop" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "develop"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "ci",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.production[0] will be created
  + resource "github_branch_protection" "production" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "production/*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "ci",
            ]
          + strict   = true
        }
    }

  # github_branch_protection.staging[0] will be created
  + resource "github_branch_protection" "staging" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "staging/*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "ci",
            ]
          + strict   = true
        }
    }

  # github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Generated Kubernetes manifests repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "generated-manifests"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + branch_protection_rules   = {
      + develop    = {
          + id      = (known after apply)
          + pattern = "develop"
        }
      + production = {
          + id      = (known after apply)
          + pattern = "production/*"
        }
      + staging    = {
          + id      = (known after apply)
          + pattern = "staging/*"
        }
    }
  + cloudwatch_log_group_arn  = (known after apply)
  + cloudwatch_log_group_name = "/github-repository/generated-manifests"
  + repository_full_name      = (known after apply)
  + repository_html_url       = (known after apply)
  + repository_http_clone_url = (known after apply)
  + repository_id             = (known after apply)
  + repository_node_id        = (known after apply)
  + repository_ssh_clone_url  = (known after apply)

```

</details>

---
*🤖 Automated by: `GitHub Repository Management - CI/CD` | Environment: `generated-manifests`*
